# SQL Joins

### Import packages 
sqlite3
pandas
   
### Connect to databases cats.db, dogs.db and owners.db using sqlite3 (use for example conn = sqlite3.connect('cats.db') and then c = conn.cursor())

Let's try and work through some exercises to recap and retain the foundational knowledge of the language that our beloved databases use.

In the suburbs of Capitol Hill, there is a new pet daycare starting up that distributes pets among 4 houses.
Down below we have tables representing cats and dogs in the particular houses, and corresponding owners. 

Cats Table:

Name  			 | Breed 			| House_Number| Owner_ID|       
------------- | ------------- | ------------|---------
Bell  			| Siamese			|		1	    | 4
Jackson  		| Balinese 		|       2     |3
Precious  	| Himalayan  		|         3    | 4
Rocky			| Egyptian Mau 	| 4 		    | 2
Samson			| Javanese		|	4		| 1

Dogs Table:

Name  			 | Breed 	| House_Number	|Owner_ID|
-------------| ------------- | ------------|-----   
Rex  			| Chihuahua  		|		1	    |3
Clifford  	| German Shepherd|     2        |2
Lucky  		| Daschund  		|     3        |1
Bobo			| Shih-Tzu		|    2		   | 4
Buddy			| Golden Retriever | 4		   | 2
Leo				| English Bulldog | 1 | 2

Owners Table:

Name  		| Phone	| Address	|ID| 
-------------| ------------- | ------------|-----
Josh Daniell  | 313-287-9573  |1440 G St. |1
Alison Peebles Madigan| 214-709-8190| None |2
Avi Flombaum	| 469-878-0125  |  1776 New York Ave| 3
Justin Bieber | 410-381-0987 | None | 4


Write the appropriate SQL queries to satisfy the following prompts:

A. Write a SQL query that can grab the names of all pets owned by the founder of Flatiron School, Avi Flombaum

B. Which House_Number contains the most number of pets in it and how many?

C. The daycare realized that House 4 needs the owners of its pets to update their addresses. Grab the names and phone numbers of owners with pets in house 4 that do not currently have an address.

In [2]:
import pandas as pd
import sqlite3

In [5]:
conn1 = sqlite3.connect('cats.db')
c1 = conn1.cursor()

In [6]:
conn2 = sqlite3.connect('dogs.db')
c2 = conn2.cursor()

In [7]:
conn3 = sqlite3.connect('owners.db')
c3 = conn3.cursor()

In [8]:
c3.execute('''SELECT * FROM owners''').fetchall()

[('Josh Daniell', '3132879573', '1440 G st.', '1'),
 ('Alison Peebles Madigan', '2147098190', 'None', '2'),
 ('Avi Flombaum', '4698780125', '1776 New York Ave', '3'),
 ('Justin Bieber', '4103810987', 'None', '4')]

In [9]:
c1.execute('''SELECT cats.name, dogs.name FROM cats JOIN dogs USING(Owner_ID) JOIN owners ON owners.ID = dogs.Owner_ID WHERE owners.ID = 'Avi Flombaum'''').fetchall()

SyntaxError: EOL while scanning string literal (<ipython-input-9-73d9bfc32c08>, line 1)

In [12]:
sql = 'SELECT * FROM cats'
df1 = pd.read_sql_query(sql, conn1)
sql2 = 'SELECT * FROM dogs'
df2 = pd.read_sql_query(sql2, conn2)
sql3 = 'SELECT * FROM owners'
df3 = pd.read_sql_query(sql3, conn3)

result = df1.merge(df2, left_on='Owner_ID', right_on='Owner_ID'

TypeError: merge() got an unexpected keyword argument 'axis'

In [11]:
result

,Name_x,Breed_x,House_Number_x,Owner_ID,Name_y,Breed_y,House_Number_y
0,Bell,Siamese,1,4,Bobo,Shih-Tzu,2
1,Precious,Himalayan,3,4,Bobo,Shih-Tzu,2
2,Jackson,Balinese,2,3,Rex,Chihuahua,1
3,Rocky,Egyptian Mau,4,2,Clifford,German Shepherd,2
4,Rocky,Egyptian Mau,4,2,Buddy,Golden Retriever,4
5,Rocky,Egyptian Mau,4,2,Leo,English Bulldog,1
6,Samson,Javanese,5,1,Lucky,Daschund,3

In [17]:
conn = sqlite3.connect('cats.db')
c = conn.cursor()
c.execute('ATTACH DATABASE "dogs.db" AS db_dogs')
c.execute('ATTACH DATABASE "owners.db" AS db_owners')

sql_str = """

SELECT * from db_owners.owners o
LEFT JOIN cats c ON c.Owner_ID = o.ID
LEFT JOIN dogs d ON d.Owner_ID = c.Owner_ID
WHERE o.Name="Avi Flombaum"


"""


df = pd.DataFrame(c.execute(sql_str).fetchall())

df

,0,1,2,3,4,5,6,7,8,9,10,11
0,Avi Flombaum,4698780125,1776 New York Ave,3,Jackson,Balinese,2,3,Rex,Chihuahua,1,3

In [14]:
sql_str = """

SELECT * from db_owners.owners o
LEFT JOIN dogs d ON d.Owner_ID = o.ID
WHERE o.Name="Avi Flombaum"


"""


df = pd.DataFrame(c.execute(sql_str).fetchall())

df

              0           1                  2  3    4          5  6  7
0  Avi Flombaum  4698780125  1776 New York Ave  3  Rex  Chihuahua  1  3